{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Acura",
    "1": "Alfa Romeo",
    "10": "Dodge",
    "11": "FIAT",
    "12": "Ferrari",
    "13": "Ford",
    "14": "GMC",
    "15": "Genesis",
    "16": "Honda",
    "17": "Hyundai",
    "18": "INFINITI",
    "19": "Jaguar",
    "2": "Aston Martin",
    "20": "Jeep",
    "21": "Kia",
    "22": "Lamborghini",
    "23": "Land Rover",
    "24": "Lexus",
    "25": "Lincoln",
    "26": "MINI",
    "27": "Maserati",
    "28": "Mazda",
    "29": "McLaren",
    "3": "Audi",
    "30": "Mercedes-Benz",
    "31": "Mitsubishi",
    "32": "Nissan",
    "33": "Porsche",
    "34": "Ram",
    "35": "Rolls-Royce",
    "36": "Subaru",
    "37": "Tesla",
    "38": "Toyota",
    "39": "Volkswagen",
    "4": "BMW",
    "40": "Volvo",
    "41": "smart",
    "5": "Bentley",
    "6": "Buick",
    "7": "Cadillac",
    "8": "Chevrolet",
    "9": "Chrysler"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acura": "0",
    "Alfa Romeo": "1",
    "Aston Martin": "2",
    "Audi": "3",
    "BMW": "4",
    "Bentley": "5",
    "Buick": "6",
    "Cadillac": "7",
    "Chevrolet": "8",
    "Chrysler": "9",
    "Dodge": "10",
    "FIAT": "11",
    "Ferrari": "12",
    "Ford": "13",
    "GMC": "14",
    "Genesis": "15",
    "Honda": "16",
    "Hyundai": "17",
    "INFINITI": "18",
    "Jaguar": "19",
    "Jeep": "20",
    "Kia": "21",
    "Lamborghini": "22",
    "Land Rover": "23",
    "Lexus": "24",
    "Lincoln": "25",
    "MINI": "26",
    "Maserati": "27",
    "Mazda": "28",
    "McLaren": "29",
    "Mercedes-Benz": "30",
    "Mitsubishi": "31",
    "Nissan": "32",
    "Porsche": "33",
    "Ram": "34",
    "Rolls-Royce": "35",
    "Subaru": "36",
    "Tesla": "37",
    "Toyota": "38",
    "Volkswagen": "39",
    "Volvo": "40",
    "smart": "41"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.17.0"
}
